app/Controllers/BaseController.php

    protected function obtenerCategoriasConProductosActivos(): array
    {
        $productoModel = new \App\Models\Bebida_model();

        $resultados = $productoModel
            ->select('categoria.id_categoria, categoria.nombre_categoria')
            ->join('categoria', 'categoria.id_categoria = bebida.id_categoria')
            ->where('bebida.estado_bebida', 1)
            ->groupBy('categoria.id_categoria, categoria.nombre_categoria')
            ->orderBy('categoria.nombre_categoria', 'ASC') // ✅ Ordena alfabéticamente
            ->findAll();
---
SELECT `categoria`.`id_categoria`, `categoria`.`nombre_categoria`
FROM `bebida`
JOIN `categoria` ON `categoria`.`id_categoria` = `bebida`.`id_categoria`
WHERE `bebida`.`estado_bebida` = 1
GROUP BY `categoria`.`id_categoria`, `categoria`.`nombre_categoria`
ORDER BY `categoria`.`nombre_categoria` ASC