app/Controllers/Carrito_controller.php

SELECT *
FROM `bebida`
WHERE `bebida`.`id_bebida` = '26'
---
    public function agregar_carrito()
    {
        if (session('id_perfil') != 2) {
            return redirect()->to('/');
        }

        $cart = \Config\Services::cart();
        $bebidaModel = new Bebida_model();
        $id = $this->request->getPost('id');

        // Buscamos la bebida acoplando la promoción vigente (si existiera)
        $bebida = $bebidaModel
            ->select('bebida.*, promocion.tipo_promocion, promocion.valor_promocion, promocion.estado_promocion')
            ->join('promocion', 'bebida.id_bebida = promocion.id_bebida AND promocion.estado_promocion = 1', 'left')
            ->where('bebida.id_bebida', $id)
            ->first();

        if (!$bebida) {
            return redirect()->back()
                ->with('error_stock', 'Bebida no encontrada.');

SELECT `ciudad`.*, `provincia`.`nombre_provincia`
FROM `ciudad`
JOIN `provincia` ON `provincia`.`id_provincia` = `ciudad`.`id_provincia`
ORDER BY `nombre_ciudad` ASC
SELECT *
FROM `provincia`
ORDER BY `nombre_provincia` ASC
SELECT *
FROM `medio_pago`
WHERE `estado_medio_pago` = 1
ORDER BY `nombre_medio_pago` ASC
---
    public function ordenar_compra()
    {
        if (session('id_perfil') != 2) {
            return redirect()->to('/');
        }
        $ciudadModel = new Ciudad_model();
        $provinciaModel = new Provincia_model();
        $medioPagoModel = new Medio_pago_model();
        $ciudades = $ciudadModel
            ->select('ciudad.*, provincia.nombre_provincia')
            ->join('provincia', 'provincia.id_provincia = ciudad.id_provincia')
            ->orderBy('nombre_ciudad', 'ASC')
            ->findAll();
        $provincias = $provinciaModel
            ->orderBy('nombre_provincia', 'ASC')
            ->findAll();
        $medios_pago = $medioPagoModel
            ->where('estado_medio_pago', 1)
            ->orderBy('nombre_medio_pago', 'ASC')
            ->findAll();

SELECT *
FROM `medio_pago`
WHERE LOWER(nombre_medio_pago) = 'efectivo'
AND `estado_medio_pago` = 1
 LIMIT 1
---
    public function guardar_venta()
    {
        if (session('id_perfil') != 2) {
            return redirect()->to('/');
        }
        $cart = \Config\Services::cart();
        $ventaModel = new Ventas_model();
        $detalleVentaModel = new Detalle_ventas_model();
        $bebidaModel = new Bebida_model();
        $direccionModel = new Direccion_model();
        $detalleEnvioModel = new Detalle_envio_model();
        $ciudadModel = new Ciudad_model();
        $provinciaModel = new Provincia_model();
        $medioPagoModel = new Medio_pago_model();
        $cart1 = $cart->contents();
        if (empty($cart1)) {
            return redirect()->to('ver_carrito');
        }
        $datos_envio = session()->get('datos_envio');
        if (!$datos_envio) {
            return redirect()->to('ordenar_compra')
                ->with('error', 'Faltan los datos de envío.');
        }
        // VALIDAR MEDIO DE PAGO
        $medioPago = $medioPagoModel
            ->where('LOWER(nombre_medio_pago)', strtolower($datos_envio['medio_pago']))
            ->where('estado_medio_pago', 1)
            ->first();

INSERT INTO `venta` (`id_usuario`, `id_medio_pago`, `fecha_venta`, `total_venta`) VALUES ('2', 3, '2026-06-25 13:27:10', 13950)
INSERT INTO `direccion` (`id_usuario`, `calle`, `altura`, `codigo_postal`, `id_ciudad`) VALUES ('2', 'Luzuriaga', '1282', '3400', '8')
INSERT INTO `detalle_envio` (`id_venta`, `id_direccion`, `costo_envio`) VALUES (18, 17, 0)
---
            }
        }
        // INSERTAR VENTA
        $id_venta = $ventaModel->insert([
            'id_usuario'    => session('id_usuario'),
            'id_medio_pago' => (int)$medioPago['id_medio_pago'],
            'fecha_venta'   => date('Y-m-d H:i:s'),
            'total_venta'   => $totalVenta
        ]);
        // INSERTAR DIRECCIÓN
        $id_direccion = $direccionModel->insert([
            'id_usuario'    => session('id_usuario'),
            'calle'         => $datos_envio['calle'],
            'altura'        => $datos_envio['altura'],
            'codigo_postal' => $datos_envio['codigo_postal'],
            'id_ciudad'     => $datos_envio['id_ciudad']
        ]);

        // INSERTAR DETALLE ENVÍO
        $detalleEnvioModel->insert([
            'id_venta'     => $id_venta,
            'id_direccion' => $id_direccion,
            'costo_envio'  => 0
        ]);

UPDATE `bebida` SET `stock_bebida` = 44
WHERE `bebida`.`id_bebida` IN ('1')
SELECT *
FROM `ciudad`
WHERE `ciudad`.`id_ciudad` = '8'
SELECT *
FROM `provincia`
WHERE `provincia`.`id_provincia` = '7'
---
            ];
            $detalleVentaModel->registrar_detalle($datosDetalle);
            $bebida = $bebidaModel->find($item['id']);
            $bebidaModel->update($item['id'], [
                'stock_bebida' => $bebida['stock_bebida'] - $item['qty']
            ]);
        }
        $ciudadData = $ciudadModel->find($datos_envio['id_ciudad']);
        $nombreCiudad = $ciudadData ? $ciudadData['nombre_ciudad'] : 'No especificada';
        $provinciaData = $ciudadData
            ? $provinciaModel->find($ciudadData['id_provincia'])

SELECT `venta`.*, `medio_pago`.`nombre_medio_pago`, `direccion`.`calle`, `direccion`.`altura`, `direccion`.`codigo_postal`, `ciudad`.`nombre_ciudad`, `provincia`.`nombre_provincia`
FROM `venta`
LEFT JOIN `medio_pago` ON `medio_pago`.`id_medio_pago` = `venta`.`id_medio_pago`
LEFT JOIN `detalle_envio` ON `detalle_envio`.`id_venta` = `venta`.`id_venta`
LEFT JOIN `direccion` ON `direccion`.`id_direccion` = `detalle_envio`.`id_direccion`
LEFT JOIN `ciudad` ON `ciudad`.`id_ciudad` = `direccion`.`id_ciudad`
LEFT JOIN `provincia` ON `provincia`.`id_provincia` = `ciudad`.`id_provincia`
WHERE `venta`.`id_usuario` = '2'
ORDER BY `venta`.`fecha_venta` DESC
SELECT `detalle_ventas`.*, `bebida`.`nombre_bebida`
FROM `detalle_ventas`
JOIN `bebida` ON `bebida`.`id_bebida` = `detalle_ventas`.`id_bebida`
WHERE `id_venta` = '18'
---
    public function historial_cliente()
    {
        if (session('id_perfil') != 2) {
            return redirect()->to('/');
        }
        $ventaModel = new Ventas_model();
        $detalleVentaModel = new Detalle_ventas_model();
        $id_usuario = session('id_usuario');
        $ventas_raw = $ventaModel
            ->select('
                venta.*,
                medio_pago.nombre_medio_pago,
                direccion.calle,
                direccion.altura,
                direccion.codigo_postal,
                ciudad.nombre_ciudad,
                provincia.nombre_provincia
            ')
            ->join('medio_pago', 'medio_pago.id_medio_pago = venta.id_medio_pago', 'left')
            ->join('detalle_envio', 'detalle_envio.id_venta = venta.id_venta', 'left')
            ->join('direccion', 'direccion.id_direccion = detalle_envio.id_direccion', 'left')
            ->join('ciudad', 'ciudad.id_ciudad = direccion.id_ciudad', 'left')
            ->join('provincia', 'provincia.id_provincia = ciudad.id_provincia', 'left')
            ->where('venta.id_usuario', $id_usuario)
            ->orderBy('venta.fecha_venta', 'DESC')
            ->findAll();
        $ventas = [];
        foreach ($ventas_raw as $venta) {
            $detalles = $detalleVentaModel
                ->select('detalle_ventas.*, bebida.nombre_bebida')
                ->join('bebida', 'bebida.id_bebida = detalle_ventas.id_bebida')
                ->where('id_venta', $venta['id_venta'])
                ->findAll();