app/Controllers/Carrito_controller.php

    public function listar_ventas()
    {
        if (session('id_perfil') != 1) {
            return redirect()->to('/');
        }

        $ventaModel = new Ventas_model();

        $builder = $ventaModel
            ->select('
                venta.*,
                medio_pago.nombre_medio_pago,
                usuario.nombre_usuario,
                usuario.apellido_usuario,
                usuario.email_usuario,
                direccion.calle,
                direccion.altura,
                direccion.codigo_postal,
                ciudad.nombre_ciudad,
                provincia.nombre_provincia
            ')
            ->join('usuario', 'usuario.id_usuario = venta.id_usuario')
            ->join('medio_pago', 'medio_pago.id_medio_pago = venta.id_medio_pago', 'left')
            ->join('detalle_envio', 'detalle_envio.id_venta = venta.id_venta', 'left')
            ->join('direccion', 'direccion.id_direccion = detalle_envio.id_direccion', 'left')
            ->join('ciudad', 'ciudad.id_ciudad = direccion.id_ciudad', 'left')
            ->join('provincia', 'provincia.id_provincia = ciudad.id_provincia', 'left')
            ->orderBy('venta.fecha_venta', 'DESC');

        $ventas = $builder->findAll();
---
SELECT `venta`.*, `medio_pago`.`nombre_medio_pago`, `usuario`.`nombre_usuario`, `usuario`.`apellido_usuario`, `usuario`.`email_usuario`, `direccion`.`calle`, `direccion`.`altura`, `direccion`.`codigo_postal`, `ciudad`.`nombre_ciudad`, `provincia`.`nombre_provincia`
FROM `venta`
JOIN `usuario` ON `usuario`.`id_usuario` = `venta`.`id_usuario`
LEFT JOIN `medio_pago` ON `medio_pago`.`id_medio_pago` = `venta`.`id_medio_pago`
LEFT JOIN `detalle_envio` ON `detalle_envio`.`id_venta` = `venta`.`id_venta`
LEFT JOIN `direccion` ON `direccion`.`id_direccion` = `detalle_envio`.`id_direccion`
LEFT JOIN `ciudad` ON `ciudad`.`id_ciudad` = `direccion`.`id_ciudad`
LEFT JOIN `provincia` ON `provincia`.`id_provincia` = `ciudad`.`id_provincia`
ORDER BY `venta`.`fecha_venta` DESC


        foreach ($ventas as $venta) {

            $detalles = $detalleVentaModel
                ->select('detalle_ventas.*, bebida.nombre_bebida')
                ->join('bebida', 'bebida.id_bebida = detalle_ventas.id_bebida')
                ->where('id_venta', $venta['id_venta'])
                ->findAll();
---
SELECT `detalle_ventas`.*, `bebida`.`nombre_bebida`
FROM `detalle_ventas`
JOIN `bebida` ON `bebida`.`id_bebida` = `detalle_ventas`.`id_bebida`
WHERE `id_venta` = '16'

    public function historial_cliente()
    {
        if (session('id_perfil') != 2) {
            return redirect()->to('/');
        }

        $ventaModel = new Ventas_model();
        $detalleVentaModel = new Detalle_ventas_model();

        $id_usuario = session('id_usuario');

        $ventas_raw = $ventaModel
            ->select('
                venta.*,
                medio_pago.nombre_medio_pago,
                direccion.calle,
                direccion.altura,
                direccion.codigo_postal,
                ciudad.nombre_ciudad,
                provincia.nombre_provincia
            ')
            ->join('medio_pago', 'medio_pago.id_medio_pago = venta.id_medio_pago', 'left')
            ->join('detalle_envio', 'detalle_envio.id_venta = venta.id_venta', 'left')
            ->join('direccion', 'direccion.id_direccion = detalle_envio.id_direccion', 'left')
            ->join('ciudad', 'ciudad.id_ciudad = direccion.id_ciudad', 'left')
            ->join('provincia', 'provincia.id_provincia = ciudad.id_provincia', 'left')
            ->where('venta.id_usuario', $id_usuario)
            ->orderBy('venta.fecha_venta', 'DESC')
            ->findAll();
---
SELECT `venta`.*, `medio_pago`.`nombre_medio_pago`, `direccion`.`calle`, `direccion`.`altura`, `direccion`.`codigo_postal`, `ciudad`.`nombre_ciudad`, `provincia`.`nombre_provincia`
FROM `venta`
LEFT JOIN `medio_pago` ON `medio_pago`.`id_medio_pago` = `venta`.`id_medio_pago`
LEFT JOIN `detalle_envio` ON `detalle_envio`.`id_venta` = `venta`.`id_venta`
LEFT JOIN `direccion` ON `direccion`.`id_direccion` = `detalle_envio`.`id_direccion`
LEFT JOIN `ciudad` ON `ciudad`.`id_ciudad` = `direccion`.`id_ciudad`
LEFT JOIN `provincia` ON `provincia`.`id_provincia` = `ciudad`.`id_provincia`
WHERE `venta`.`id_usuario` = '2'
ORDER BY `venta`.`fecha_venta` DESC


        foreach ($ventas_raw as $venta) {

            $detalles = $detalleVentaModel
                ->select('detalle_ventas.*, bebida.nombre_bebida')
                ->join('bebida', 'bebida.id_bebida = detalle_ventas.id_bebida')
                ->where('id_venta', $venta['id_venta'])
                ->findAll();
---
SELECT `detalle_ventas`.*, `bebida`.`nombre_bebida`
FROM `detalle_ventas`
JOIN `bebida` ON `bebida`.`id_bebida` = `detalle_ventas`.`id_bebida`
WHERE `id_venta` = '16'