app/Controllers/Home.php

SELECT `bebida`.*, `marca`.`nombre_marca`
FROM `bebida`
JOIN `marca` ON `bebida`.`id_marca` = `marca`.`id_marca`
WHERE `bebida`.`estado_bebida` = 1
---
    public function index(): string
    {
        $bebidaModel = new \App\Models\Bebida_model();
        $productos = $bebidaModel
            ->select('bebida.*, marca.nombre_marca')
            ->join('marca', 'bebida.id_marca = marca.id_marca')
            ->where('bebida.estado_bebida', 1)
            ->findAll();