app/Controllers/Mensaje_controller.php

SELECT *
FROM `mensaje`
---
    public function eliminarConsulta($id)
    {
        $mensajesModel = new Mensajes_model();
        $mensajesModel->delete($id);
        return redirect()->to('backend/ver_consultas')->with('mensaje', 'Consulta eliminada exitosamente.');