app/Controllers/Producto_controller.php

    public function catalogo()
    {
        $bebidaModel = new Bebida_model();

        $marca = $this->request->getGet('marca');
        $categoria = $this->request->getGet('categoria');
        $precio_max = $this->request->getGet('precio_max');

        $builder = $bebidaModel
            ->select('bebida.*, marca.nombre_marca, categoria.nombre_categoria')
            ->join('marca', 'bebida.id_marca = marca.id_marca')
            ->join('categoria', 'bebida.id_categoria = categoria.id_categoria')
            ->where('bebida.estado_bebida', 1)
            ->orderBy('categoria.nombre_categoria', 'ASC')
            ->orderBy('bebida.nombre_bebida', 'ASC');

        if (!empty($marca)) {
            $builder->like('marca.nombre_marca', $marca);
        }

        if (!empty($categoria)) {
            $builder->like('categoria.nombre_categoria', $categoria);
        }

        if (!empty($precio_max)) {
            $builder->where('bebida.precio_bebida <=', $precio_max);
        }

        $data = [
            'bebida' => $builder->findAll(),
            'marca' => (new Marca_model())->findAll(),
            'categoria' => (new Categoria_model())
                ->orderBy('nombre_categoria', 'ASC')
                ->findAll()
        ];
---
SELECT `bebida`.*, `marca`.`nombre_marca`, `categoria`.`nombre_categoria`
FROM `bebida`
JOIN `marca` ON `bebida`.`id_marca` = `marca`.`id_marca`
JOIN `categoria` ON `bebida`.`id_categoria` = `categoria`.`id_categoria`
WHERE `bebida`.`estado_bebida` = 1
ORDER BY `categoria`.`nombre_categoria` ASC, `bebida`.`nombre_bebida` ASC
SELECT *
FROM `marca`
SELECT *
FROM `categoria`
ORDER BY `nombre_categoria` ASC

    public function listarBebidas()
    {
        if (session('id_perfil') != 1) {
            return redirect()->to('/');
        }

        $bebidaModel = new Bebida_model();

        $categoriaId = $this->request->getGet('id_categoria');
        $busqueda = $this->request->getGet('busqueda');

        $bebidas = $bebidaModel
            ->select('bebida.*, marca.nombre_marca, categoria.nombre_categoria')
            ->join('marca', 'bebida.id_marca = marca.id_marca')
            ->join('categoria', 'bebida.id_categoria = categoria.id_categoria');

        if (!empty($categoriaId)) {
            $bebidas->where('bebida.id_categoria', $categoriaId);
        }

        if (!empty($busqueda)) {

            $bebidas->groupStart()
                ->like('bebida.nombre_bebida', $busqueda)
                ->orLike('marca.nombre_marca', $busqueda)
                ->groupEnd();
        }

        $data = [
            'bebidas' => $bebidas->findAll(),
            'categorias' => (new Categoria_model())
                ->orderBy('nombre_categoria', 'ASC')
                ->findAll()
        ];
---
SELECT `bebida`.*, `marca`.`nombre_marca`, `categoria`.`nombre_categoria`
FROM `bebida`
JOIN `marca` ON `bebida`.`id_marca` = `marca`.`id_marca`
JOIN `categoria` ON `bebida`.`id_categoria` = `categoria`.`id_categoria`
SELECT *
FROM `categoria`
ORDER BY `nombre_categoria` ASC

    public function editar($id_bebida)
    {
        if (session('id_perfil') != 1) {
            return redirect()->to('/');
        }

        $bebidaModel = new Bebida_model();

        $bebida = $bebidaModel->find($id_bebida);

        if (!$bebida) {
            return redirect()->to('gestionar_bebidas')
                ->with('mensaje', 'Bebida no encontrada.');
        }

        return $this->renderizarConNavbar(
            'backend/registrar_bebida',
            [
                'bebida' => $bebida,
                'marca' => (new Marca_model())->findAll(),
                'categoria' => (new Categoria_model())
                    ->orderBy('nombre_categoria', 'ASC')
                    ->findAll()
            ]
        );
---
SELECT *
FROM `categoria`
ORDER BY `nombre_categoria` ASC

    public function actualizarBebida($id_bebida)
    {
        if (session('id_perfil') != 1) {
            return redirect()->to('/');
        }

        $bebidaModel = new Bebida_model();

        $bebida = $bebidaModel->find($id_bebida);

        if (!$bebida) {
            return redirect()->to('gestionar_bebidas')
                ->with('mensaje', 'Bebida no encontrada.');
---
SELECT *
FROM `bebida`
WHERE `bebida`.`id_bebida` = '2'
SELECT `bebida`.*, `marca`.`nombre_marca`, `categoria`.`nombre_categoria`
FROM `bebida`
LEFT JOIN `marca` ON `bebida`.`id_marca` = `marca`.`id_marca`
LEFT JOIN `categoria` ON `bebida`.`id_categoria` = `categoria`.`id_categoria`

            $datos['imagen_bebida'] = $nombreImagen;
        }

        $bebidaModel->update($id_bebida, $datos);
---
UPDATE `bebida` SET `nombre_bebida` = 'Miller Six Pack', `descripcion_bebida` = 'Es una cerveza tipo American Lager, famosa por su proceso de filtrado en frío cuatro veces, lo que le otorga un sabor suave, fresco y un color dorado brillante.', `precio_bebida` = '13575.25', `stock_bebida` = '36', `volumen_bebida` = '473', `grado_bebida` = '4.20', `id_marca` = '4', `id_categoria` = '2'
WHERE `bebida`.`id_bebida` IN ('2')


            'bebida' => $bebidaModel->findAll(),

            'categoria' => (new Categoria_model())
                ->orderBy('nombre_categoria', 'ASC')
                ->findAll(),
---
SELECT *
FROM `categoria`
ORDER BY `nombre_categoria` ASC