app/Controllers/Producto_controller.php

SELECT *
FROM `categoria`
ORDER BY `nombre_categoria` ASC
SELECT *
FROM `marca`
SELECT `bebida`.*, `marca`.`nombre_marca`, `categoria`.`nombre_categoria`, `promocion`.`tipo_promocion`, `promocion`.`valor_promocion`, `promocion`.`fecha_inicio`, `promocion`.`fecha_fin`, `promocion`.`estado_promocion`
FROM `bebida`
JOIN `marca` ON `bebida`.`id_marca` = `marca`.`id_marca`
JOIN `categoria` ON `bebida`.`id_categoria` = `categoria`.`id_categoria`
LEFT JOIN `promocion` ON `bebida`.`id_bebida` = `promocion`.`id_bebida` AND `promocion`.`estado_promocion` = 1
WHERE `bebida`.`estado_bebida` = 1
ORDER BY `categoria`.`nombre_categoria` ASC, `bebida`.`nombre_bebida` ASC
---
    public function catalogo()
    {
        $bebidaModel = new Bebida_model();
        $marca = $this->request->getGet('marca');
        $categoria = $this->request->getGet('categoria');
        $precio_max = $this->request->getGet('precio_max');

        // Agregamos los campos de promoción al select y su correspondiente LEFT JOIN
        $builder = $bebidaModel
            ->select('bebida.*, marca.nombre_marca, categoria.nombre_categoria, promocion.tipo_promocion, promocion.valor_promocion, promocion.fecha_inicio, promocion.fecha_fin, promocion.estado_promocion')
            ->join('marca', 'bebida.id_marca = marca.id_marca')
            ->join('categoria', 'bebida.id_categoria = categoria.id_categoria')
            ->join('promocion', 'bebida.id_bebida = promocion.id_bebida AND promocion.estado_promocion = 1', 'left') // <-- Crucial
            ->where('bebida.estado_bebida', 1)
            ->orderBy('categoria.nombre_categoria', 'ASC')
            ->orderBy('bebida.nombre_bebida', 'ASC');

        if (!empty($marca)) {
            $builder->like('marca.nombre_marca', $marca);
        }
        if (!empty($categoria)) {
            $builder->like('categoria.nombre_categoria', $categoria);
        }
        if (!empty($precio_max)) {
            $builder->where('bebida.precio_bebida <=', $precio_max);
        }

        $marcaModel = new Marca_model();
        $categoriaModel = new Categoria_model();

        $data = [
            'bebida'    => $builder->findAll(),
            'marca'     => $marcaModel->listar_marcas(),
            'categoria' => $categoriaModel->listar_categorias()
        ];

INSERT INTO `bebida` (`nombre_bebida`, `descripcion_bebida`, `precio_bebida`, `stock_bebida`, `imagen_bebida`, `id_marca`, `volumen_bebida`, `grado_bebida`, `id_categoria`, `estado_bebida`) VALUES ('Skyy Citrus', 'Se caracteriza por su sabor refrescante y afrutado, con notas predominantes de cítricos, y un acabado limpio. Está hecho con un vodka de alta calidad, destilado cuatro veces y filtrado tres veces, lo que le confiere una suavidad excepcional. \r\n', '8960.35', '88', '1777414370_0ecf69eebc98b5e7a76d.jpg', '29', '750', '29', '7', 1)
---
            $this->request->getPost('id_marca')
        ]);

        $idBebidaCreada = $db->insertID();

SELECT `bebida`.*, `marca`.`nombre_marca`, `categoria`.`nombre_categoria`
FROM `bebida`
LEFT JOIN `marca` ON `bebida`.`id_marca` = `marca`.`id_marca`
LEFT JOIN `categoria` ON `bebida`.`id_categoria` = `categoria`.`id_categoria`
---
    public function habilitar($id_bebida)
    {
        if (session('id_perfil') != 1) {
            return redirect()->to('/');
        }
        $bebidaModel = new Bebida_model();

        // CORRECCIÓN: Uso de la instancia $bebidaModel local
        $bebidaModel->update($id_bebida, ['estado_bebida' => 1]);
        return redirect()->to('gestionar_bebidas')->with('mensaje', 'Bebida habilitada correctamente.');