app/Controllers/Usuario_controller.php

    public function listarUsuarios()
    {
        if (session('id_perfil') != 1) {
            return redirect()->to('/');
        }
        $usuarioModel = new Usuario_model();
        $perfil = $this->request->getGet('perfil');
        $email = $this->request->getGet('email');
        $query = $usuarioModel;
        if (!empty($perfil)) {
            $query = $query->where('id_perfil', $perfil);
        }
        if (!empty($email)) {
            $query = $query->like('email_usuario', $email);
        }
        $data['usuarios'] = $query->findAll();
---
SELECT *
FROM `usuario`