app/Models/Categoria_model.php

SELECT *
FROM `categoria`
ORDER BY `nombre_categoria` ASC
---
    public function listar_categorias()
    {
        return $this->orderBy('nombre_categoria', 'ASC')->findAll();