app/Models/Detalle_ventas_model.php

INSERT INTO `detalle_ventas` (`id_venta`, `id_bebida`, `detalle_cantidad`, `detalle_precio`) VALUES (18, '1', 1, 13950)
---
    public function registrar_detalle($data)
    {
        return $this->insert([
            'id_venta'         => $data['id_venta'],
            'id_bebida'        => $data['id_bebida'],
            'detalle_cantidad' => $data['detalle_cantidad'],
            'detalle_precio'   => $data['detalle_precio']
        ]);