app/Models/Marca_model.php

SELECT *
FROM `marca`
ORDER BY `nombre_marca` ASC
---
    public function listar_marcas()
    {
        return $this->orderBy('nombre_marca', 'ASC')->findAll();